Ran Plan for 3 projects:

1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
1. project: `crawlinghub-eventbridge-prod` dir: `terraform/eventbridge` workspace: `default`
---

### 1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/ecs-web-api/crawlinghub-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/ecs-web-api": exit status 1
module.ecs_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Reading...
module.ecs_task_execution_role.aws_iam_role.this: Refreshing state... [id=crawlinghub-web-api-execution-role-prod]
module.ecs_task_role.aws_iam_role.this: Refreshing state... [id=crawlinghub-web-api-task-role-prod]
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.eventbridge_role_arn: Reading...
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_task_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
module.ecs_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.web_api_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/crawlinghub-web-api-prod/application]
data.aws_ssm_parameter.public_subnets: Reading...
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG]
data.aws_ssm_parameter.amp_workspace_id: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_elasticache_cluster.redis: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ecr_repository.web_api: Reading...
data.aws_ssm_parameter.public_subnets: Read complete after 0s [id=/shared/network/public-subnets]
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/crawlinghub-cluster-prod]
module.ecs_task_execution_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.certificate_arn: Reading...
module.ecs_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_task_execution_role.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_workspace_id: Read complete after 0s [id=/shared/monitoring/amp-workspace-id]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_secretsmanager_secret_version.rds: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
module.alb_security_group.aws_security_group.this: Refreshing state... [id=sg-08eb1fa30c689e592]
module.alb.aws_lb_target_group.this["web-api"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-alb-prod-web-api/317bc1ed4a01878e]
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-02997a2675e266a40]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG|AWSCURRENT]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_elasticache_cluster.redis: Read complete after 0s [id=crawlinghub-redis-prod]
module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"]: Refreshing state... [id=sgr-00a0bb1d5c9abb669]
module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"]: Refreshing state... [id=sgr-07cd584511154f7cc]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/d1dbe35850991a10]
module.ecs_security_group.aws_vpc_security_group_ingress_rule.ecs-from-alb[0]: Refreshing state... [id=sgr-0180eebfd172b62e6]
module.alb_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-062609eabf13aa506]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0c787c9cabd647494]
data.aws_ecr_repository.web_api: Read complete after 0s [id=crawlinghub-web-api-prod]
module.alb.aws_lb_listener.https["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/d1dbe35850991a10/eb7439e00b2187d4]
module.alb.aws_lb_listener.http["http-redirect"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/d1dbe35850991a10/b70f198886f99ce7]
aws_route53_record.web_api: Refreshing state... [id=Z104656329CL6XBYE8OIJ_crawler.set-of.com_A]
module.ecs_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-web-api-execution-role-prod-ssm-access]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod-20251128025726549700000001]
module.ecs_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-web-api-execution-role-prod-secrets-manager]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading SSM Parameter (/crawlinghub/eventbridge/role-arn): couldn't find resource
│ 
│   with data.aws_ssm_parameter.eventbridge_role_arn,
│   on main.tf line 45, in data "aws_ssm_parameter" "eventbridge_role_arn":
│   45: data "aws_ssm_parameter" "eventbridge_role_arn" {
│ 
╵


```
</details>

---
### 2. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 init -input=false" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/ecs-scheduler": exit status 1

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_security_group...
- ecs_security_group in .terraform/modules/ecs_security_group/terraform/modules/security-group
- ecs_security_group.tags in .terraform/modules/ecs_security_group/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for ecs_service...
- ecs_service in .terraform/modules/ecs_service/terraform/modules/ecs-service
- ecs_service.tags in .terraform/modules/ecs_service/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_logs...
- scheduler_logs in .terraform/modules/scheduler_logs/terraform/modules/cloudwatch-log-group
- scheduler_logs.tags in .terraform/modules/scheduler_logs/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_task_execution_role...
- scheduler_task_execution_role in .terraform/modules/scheduler_task_execution_role/terraform/modules/iam-role-policy
- scheduler_task_execution_role.tags in .terraform/modules/scheduler_task_execution_role/terraform/modules/common-tags
Downloading git::https://github.com/ryu-qqq/Infrastructure.git?ref=main for scheduler_task_role...
- scheduler_task_role in .terraform/modules/scheduler_task_role/terraform/modules/iam-role-policy
- scheduler_task_role.tags in .terraform/modules/scheduler_task_role/terraform/modules/common-tags

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.100.0...
╷
│ Error: Failed to install provider
│ 
│ Error while installing hashicorp/aws v5.100.0: open
│ /home/atlantis/.atlantis/plugin-cache/registry.terraform.io/hashicorp/aws/5.100.0/linux_amd64/terraform-provider-aws_v5.100.0_x5:
│ text file busy
╵


```
</details>

---
### 3. project: `crawlinghub-eventbridge-prod` dir: `terraform/eventbridge` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/eventbridge/crawlinghub-eventbridge-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/eventbridge": exit status 1
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Reading...
aws_cloudwatch_event_rule.crawler_scheduler: Refreshing state... [id=crawlinghub-scheduler-prod]
data.aws_ssm_parameter.eventbridge_trigger_queue_url: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_role.eventbridge_sqs: Refreshing state... [id=crawlinghub-eventbridge-sqs-role-prod]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.eventbridge_trigger_queue_url: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-url]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
aws_iam_role_policy.eventbridge_sqs: Refreshing state... [id=crawlinghub-eventbridge-sqs-role-prod:crawlinghub-eventbridge-sqs-policy-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_ssm_parameter.eventbridge_role_arn will be created
  + resource "aws_ssm_parameter" "eventbridge_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "EventBridge IAM Role ARN for invoking SQS"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/eventbridge/role-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-eventbridge-role-arn-prod"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-eventbridge-role-arn-prod"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EventBridge Rule (crawlinghub-scheduler-prod): operation error EventBridge: DescribeRule, https response error StatusCode: 400, RequestID: 4f21b8de-a491-4d03-a20b-7816f5689611, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/83107d1edadf4fc1958d02bbcad31cd7 is not authorized to perform: events:DescribeRule on resource: arn:aws:events:ap-northeast-2:646886795421:rule/crawlinghub-scheduler-prod because no identity-based policy allows the events:DescribeRule action
│ 
│   with aws_cloudwatch_event_rule.crawler_scheduler,
│   on main.tf line 41, in resource "aws_cloudwatch_event_rule" "crawler_scheduler":
│   41: resource "aws_cloudwatch_event_rule" "crawler_scheduler" {
│ 
╵


```
</details>

---
### Plan Summary

3 projects, 0 with changes, 0 with no changes, 3 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```